# Работа с std::vector в C++

## Что такое std::vector?

std::vector — динамический массив в C++, который автоматически управляет памятью и может изменять размер во время выполнения.
Элементы хранятся в памяти подряд, что обеспечивает быстрый доступ по индексу.
Эффективно добавляет и удаляет элементы только с конца — вставки в середину требуют сдвига данных.

[Документация на cppreference](https://en.cppreference.com/w/cpp/container/vector.html)

## Пример использования

```cpp
#include <iostream>
#include <vector>

int main()
{
    std::vector<int> v = {8, 4, 5, 9};
    
    v.push_back(6);
    v.push_back(9);
    v[2] = -1;
    
    for (size_t i = 0; i < v.size(); ++i)
        std::cout << v[i] << ' ';
}
```

**Вывод:** `8 4 -1 9 6 9`

## Практические задания
### 1. Создание и вывод вектора
Создайте вектор размера N с помощью конструктора.
Присвойте элементам значения от 1 до N с помощью operator[].
Выведите элементы на экран.
Выведите size и capacity вектора.

### 2. Работа с пустым вектором
Создайте пустой вектор целых чисел.
Добавьте элементы от 1 до 10 с помощью метода push_back.
После каждого вызова push_back выводите size и capacity.
Выведите элементы на экран.

### 3. Поиск и замена элементов
Создайте вектор из 15 случайных чисел от 1 до 100.
Выведите элементы на экран.
Найдите максимальный элемент.
Замените все вхождения максимального элемента на 0.
Выведите элементы на экран после замены.

### 4. Двумерный вектор (матрица)
Создайте двумерный вектор (вектор векторов) размером 5x5.
Заполните его случайными числами от 1 до 100.
Найдите сумму элементов главной диагонали.
Найдите максимальный элемент в каждой строке.
